README.md
- [Related Sites](#orgc98f128)
  - [[PhiloComp](http://philocomp.net)](#org63e1202)
- [Encyclopedia Entries](#org5b434d6)
  - [Stanford Encyclopedia of Philosophy](#orga478d20)
    - [[Category Theory](https://plato.stanford.edu/entries/category-theory/)](#org37719bd)
    - [[Computability and Complexity](https://plato.stanford.edu/entries/computability/)](#org7d8322b)
    - [[Computation in Physical Systems](https://plato.stanford.edu/entries/computation-physicalsystems/)](#org5af7a61)
    - [[Computational Complexity Theory](https://plato.stanford.edu/entries/computational-complexity/)](#org9990828)
    - [[Computer and Information Ethics](https://plato.stanford.edu/entries/ethics-computer/)](#org9819b16)
    - [[Computing and Moral Responsibility](https://plato.stanford.edu/entries/computing-responsibility/)](#org1d31ae3)
    - [[Information](https://plato.stanford.edu/entries/information/)](#orge9924f6)
    - [[The Lambda Calculus](https://plato.stanford.edu/archives/spr2015/entries/lambda-calculus/)](#orge7651a1)
    - [[Logic and Artificial Intelligence](https://plato.stanford.edu/entries/logic-ai/)](#orgf3a4413)
    - [[Philosophy of Computer Science](https://plato.stanford.edu/entries/computer-science/)](#org0f308d5)
    - [[Philosophy of Mathematics](https://plato.stanford.edu/entries/philosophy-mathematics/)](#org5a04486)
    - [[Philosophy of Technology](https://plato.stanford.edu/entries/technology/)](#org5e2cf39)
    - [[Recursive Functions](https://plato.stanford.edu/entries/recursive-functions/)](#org7cf6a45)
    - [[Semantic Conceptions of Information](https://plato.stanford.edu/entries/information-semantic/)](#orgc3f46a2)
    - [[Set Theory](https://plato.stanford.edu/entries/set-theory/)](#orgb4db179)
  - [Internet Encyclopedia of Philosophy](#orgdf596e9)
    - [[Artificial Intelligence](https://www.iep.utm.edu/art-inte/)](#org5e7cb00)
    - [[The Brain in a Vat Argument](https://www.iep.utm.edu/brainvat/)](#org5872af0)
    - [[The Computational Theory of Mind](https://www.iep.utm.edu/compmind/)](#org8aff60d)
  - [Wikipedia](#org2b0d49e)
    - [[Constraint logic programming](https://en.wikipedia.org/wiki/Constraint_logic_programming)](#orgb02fdb6)
    - [[Logic Programming](https://en.wikipedia.org/wiki/Logic_programming)](#orgc68b057)
    - [[Negation as failure](https://en.wikipedia.org/wiki/Negation_as_failure)](#orgb87db86)
- [Bibliographies](#org6c57416)
  - [[Philosophy of Computing and Information at PhilPapers](https://philpapers.org/browse/philosophy-of-computing-and-information)](#org4e16686)
  - [[Philosophy of Computer Science at DBLP](https://dblp.uni-trier.de/search?q=philosophy%20of%20computer%20science)](#org8e037e6)
- [Books](#org3ef5121)
  - [Freely available](#orga929048)
    - [[Philosophy of Computer Science by William Rapaport](https://cse.buffalo.edu/~rapaport/Papers/phics.pdf)](#org0834c9f)
    - [[Think Complexity, Second Edition by Allen Downey](http://greenteapress.com/wp/think-complexity-2e/)](#org1f832a5)
- [Ontology of Philosophy of Computer Science](#org37351ff)
  - [[Internet Philosophy Ontology Project](https://www.inphoproject.org/taxonomy/2301)](#org8f5ea46)
- [Blogs](#orgff67c87)
  - [[Gödel's Lost Letter and P=NP](https://rjlipton.wordpress.com)](#org1f49fbe)
  - [[The n-Category Café](https://golem.ph.utexas.edu/category/)](#org12bc745)
  - [[Shtetl-Optimized](https://www.scottaaronson.com/blog/)](#org91b4e3c)
- [Organizations and Societies](#org961dfef)
  - [[Association for Logic Programming](https://www.cs.nmsu.edu/ALP/)](#org6b3d1cb)
  - [[International Association for Computing And Philosophy](http://www.iacap.org)](#orgf6c230f)
- [Conferences and Symposia](#orgac15d17)
  - [[ACM/IEEE Symposium on Logic in Computer Science](https://lics.siglog.org)](#orgffecaf7)
- [Logic](#org5ef0177)
  - [[An Automated Modal Reasoner](https://briantackett.pythonanywhere.com)](#org425e363)
  - [[Carnap](https://carnap.io)](#orgd2155d6)
  - [[Conan](https://github.com/nonilole/Conan)- A proof editor for first order logic](#org1392704)
  - [[List of Computational Tools for Modal Logic](http://www.cs.man.ac.uk/~schmidt/tools/)](#orgd2c5c79)
  - [[Logic Matters](https://www.logicmatters.net)](#orgde373c7)
  - [[Microsoft's Lean](https://leanprover.github.io/)](#orgf6f991b)
  - [[Open Logic Project](http://openlogicproject.org)](#org32f65fb)
  - [[Proof General](https://proofgeneral.github.io)](#orgd1e462b)
  - [[SymPy Logic Module](https://docs.sympy.org/latest/modules/logic.html)](#orgf0b5bdb)
  - [[Taut](https://www.taut-logic.com)](#orgd3ad69f)
- [Programming Languages and Libraries](#org639a12a)
  - [[miniKanren](http://minikanren.org)](#org136bf33)
  - [Lisp](#orgd202f3b)
    - [[Common Lisp](https://common-lisp.net)](#org51305dd)
    - [[Clojure](https://clojure.org)](#orgfdc272e)
    - [[Scheme](https://schemers.org)](#org9b22603)
  - [Prolog](#org9800eb3)
    - [[SWI-Prolog](https://www.swi-prolog.org)](#orga4daf99)
    - [[A. Aaby's Prolog Tutorial](http://www.lix.polytechnique.fr/~liberti/public/computing/prog/prolog/prolog-tutorial.html)](#org3d0bbda)
    - [[J.R. Fisher's Prolog Tutorial](https://www.cpp.edu/~jrfisher/www/prolog_tutorial/contents.html)](#org9f04b79)
  - [Python](#org61b47af)
    - [[kanren](https://github.com/logpy/logpy)](#org2cde487)
    - [[PySWIP](https://github.com/yuce/pyswip)](#org13cbaa1)
    - [[truths - auto generate truth tables](https://github.com/tr3buchet/truths)](#org553f9cb)
    - [[tt - the Boolean expression toolbox](https://tt.brianwel.ch/en/latest/)](#org4e6ecd5)
- [Digital Philosophy](#orge086818)
  - [[Articles tagged "digital humanities" at Daily Nous](http://dailynous.com/tag/digital-humanities/)](#orgd24ca98)
  - [[Chris Alen Sula](http://chrisalensula.org)](#org8ecd910)
  - [[Philosopher's Web](https://kumu.io/GOliveira/philosophers-web#map-b9Ts7W5r)](#orgcd6c7ce)
  - [[The Philosophome](http://ontology.buffalo.edu/philosophome.org.html)](#org86d725e)
  - [[Spinoza's Ethics 2.0](https://ethics.spinozism.org)](#orga6c69eb)
    - [[Digital Spinozism](https://www.torindoppelt.com/#posts)](#org9e6c024)
  - [[Transcribing Bentham](https://blogs.ucl.ac.uk/transcribe-bentham/)](#org9fa143b)
  - [[Why and How: Exploring the Significance of Digital Humanities for Philosophy](https://digitalscholarship.files.wordpress.com/2013/02/spirowhydhapaphilosophy2013fnal.pdf)](#org7501839)
- [University Departments and Research Centers](#orgb3faa50)
  - [[Philosophy of Computer Science - Utrecht University](http://www.cs.uu.nl/groups/AD/index-phil.html)](#org389f167)
- [Magazines and Newsletters](#orgfd2e0a8)
  - [[ACM Transactions on Computational Logic (TOCL)](https://tocl.acm.org)](#orga4b8449)
  - [[Newsletter on Philosophy and Computers](https://www.apaonline.org/page/computers_newsletter) - American Philosophical Association](#org0d0e2ff)
- [Individual Philosophers](#orgdad61fe)
  - [[Peter Bradley](http://www.kaley-bradley.com)](#orge1c9056)
  - [[Luciano Floridi](http://www.philosophyofinformation.net/about/)](#org30bf827)
  - [[William J. Rapaport](https://cse.buffalo.edu/~rapaport/)](#org35cd8f8)
- [Philosophical Networks](#org52373ed)
  - [[Philosophical Wordnets](https://github.com/mboudour/WordNets/tree/master/Philosophical%20WordNets)](#org4786d28)
- [Software for Philosophers](#orgaf812c8)
  - [[Hypernomicon](http://hypernomicon.org)](#org0673900)

A curated list of awesome resources that bridge Philosophy and Computer Science.


<a id="orgc98f128"></a>

# Related Sites


<a id="org63e1202"></a>

## [PhiloComp](http://philocomp.net)

"The aim of this website is to highlight the many strong links between Philosophy and Computing, for the benefit of students (and potential students) of both disciplines:&#x2026;"

---


<a id="org5b434d6"></a>

# Encyclopedia Entries


<a id="orga478d20"></a>

## Stanford Encyclopedia of Philosophy


<a id="org37719bd"></a>

### [Category Theory](https://plato.stanford.edu/entries/category-theory/)


<a id="org7d8322b"></a>

### [Computability and Complexity](https://plato.stanford.edu/entries/computability/)


<a id="org5af7a61"></a>

### [Computation in Physical Systems](https://plato.stanford.edu/entries/computation-physicalsystems/)


<a id="org9990828"></a>

### [Computational Complexity Theory](https://plato.stanford.edu/entries/computational-complexity/)


<a id="org9819b16"></a>

### [Computer and Information Ethics](https://plato.stanford.edu/entries/ethics-computer/)


<a id="org1d31ae3"></a>

### [Computing and Moral Responsibility](https://plato.stanford.edu/entries/computing-responsibility/)


<a id="orge9924f6"></a>

### [Information](https://plato.stanford.edu/entries/information/)


<a id="orge7651a1"></a>

### [The Lambda Calculus](https://plato.stanford.edu/archives/spr2015/entries/lambda-calculus/)


<a id="orgf3a4413"></a>

### [Logic and Artificial Intelligence](https://plato.stanford.edu/entries/logic-ai/)


<a id="org0f308d5"></a>

### [Philosophy of Computer Science](https://plato.stanford.edu/entries/computer-science/)


<a id="org5a04486"></a>

### [Philosophy of Mathematics](https://plato.stanford.edu/entries/philosophy-mathematics/)


<a id="org5e2cf39"></a>

### [Philosophy of Technology](https://plato.stanford.edu/entries/technology/)


<a id="org7cf6a45"></a>

### [Recursive Functions](https://plato.stanford.edu/entries/recursive-functions/)


<a id="orgc3f46a2"></a>

### [Semantic Conceptions of Information](https://plato.stanford.edu/entries/information-semantic/)


<a id="orgb4db179"></a>

### [Set Theory](https://plato.stanford.edu/entries/set-theory/)


<a id="orgdf596e9"></a>

## Internet Encyclopedia of Philosophy


<a id="org5e7cb00"></a>

### [Artificial Intelligence](https://www.iep.utm.edu/art-inte/)


<a id="org5872af0"></a>

### [The Brain in a Vat Argument](https://www.iep.utm.edu/brainvat/)


<a id="org8aff60d"></a>

### [The Computational Theory of Mind](https://www.iep.utm.edu/compmind/)


<a id="org2b0d49e"></a>

## Wikipedia


<a id="orgb02fdb6"></a>

### [Constraint logic programming](https://en.wikipedia.org/wiki/Constraint_logic_programming)


<a id="orgc68b057"></a>

### [Logic Programming](https://en.wikipedia.org/wiki/Logic_programming)

-   [Abductive logic programming](https://en.wikipedia.org/wiki/Abductive_logic_programming)
-   [Answer set programming](https://en.wikipedia.org/wiki/Answer_set_programming)
-   [Concurrent logic programming](https://en.wikipedia.org/wiki/Concurrent_logic_programming)
-   [Inductive logic programming](https://en.wikipedia.org/wiki/Inductive_logic_programming)


<a id="orgb87db86"></a>

### [Negation as failure](https://en.wikipedia.org/wiki/Negation_as_failure)

---


<a id="org6c57416"></a>

# Bibliographies


<a id="org4e16686"></a>

## [Philosophy of Computing and Information at PhilPapers](https://philpapers.org/browse/philosophy-of-computing-and-information)


<a id="org8e037e6"></a>

## [Philosophy of Computer Science at DBLP](https://dblp.uni-trier.de/search?q=philosophy%20of%20computer%20science)

---


<a id="org3ef5121"></a>

# Books


<a id="orga929048"></a>

## Freely available


<a id="org0834c9f"></a>

### [Philosophy of Computer Science by William Rapaport](https://cse.buffalo.edu/~rapaport/Papers/phics.pdf)


<a id="org1f832a5"></a>

### [Think Complexity, Second Edition by Allen Downey](http://greenteapress.com/wp/think-complexity-2e/)

---


<a id="org37351ff"></a>

# Ontology of Philosophy of Computer Science


<a id="org8f5ea46"></a>

## [Internet Philosophy Ontology Project](https://www.inphoproject.org/taxonomy/2301)

---


<a id="orgff67c87"></a>

# Blogs


<a id="org1f49fbe"></a>

## [Gödel's Lost Letter and P=NP](https://rjlipton.wordpress.com)


<a id="org12bc745"></a>

## [The n-Category Café](https://golem.ph.utexas.edu/category/)

"A group blog on math, physics and philosophy"


<a id="org91b4e3c"></a>

## [Shtetl-Optimized](https://www.scottaaronson.com/blog/)

---


<a id="org961dfef"></a>

# Organizations and Societies


<a id="org6b3d1cb"></a>

## [Association for Logic Programming](https://www.cs.nmsu.edu/ALP/)


<a id="orgf6c230f"></a>

## [International Association for Computing And Philosophy](http://www.iacap.org)

---


<a id="orgac15d17"></a>

# Conferences and Symposia


<a id="orgffecaf7"></a>

## [ACM/IEEE Symposium on Logic in Computer Science](https://lics.siglog.org)

---


<a id="org5ef0177"></a>

# Logic


<a id="org425e363"></a>

## [An Automated Modal Reasoner](https://briantackett.pythonanywhere.com)

"This program takes lists of formalized sentences and checks them for consistency or validity in Propositional Modal Logic (S5 Axiom System)." Created by [Brian Tackett](https://briantackett.pythonanywhere.com/about/).


<a id="orgd2155d6"></a>

## [Carnap](https://carnap.io)

"Carnap is a free and open software framework written in [Haskell](https://www.haskell.org) for teaching and studying formal logic." [An introductory blog post](http://dailynous.com/2018/11/07/new-free-open-source-multi-purpose-multi-system-logic-software/ ) by the author, [Graham Leach-Krouse](https://philpeople.org/profiles/graham-leach-krouse-1) at [Daily Nous](http://dailynous.com).


<a id="org1392704"></a>

## [Conan](https://github.com/nonilole/Conan)- A proof editor for first order logic


<a id="orgd2c5c79"></a>

## [List of Computational Tools for Modal Logic](http://www.cs.man.ac.uk/~schmidt/tools/)


<a id="orgde373c7"></a>

## [Logic Matters](https://www.logicmatters.net)


<a id="orgf6f991b"></a>

## [Microsoft's Lean](https://leanprover.github.io/)

"Lean is an open source theorem prover and programming language being developed at [Microsoft Research](https://www.microsoft.com/en-us/research/). Lean aims to bridge the gap between interactive and automated theorem proving, by situating automated tools and methods in a framework that supports user interaction and the construction of fully specified axiomatic proofs."


<a id="org32f65fb"></a>

## [Open Logic Project](http://openlogicproject.org)


<a id="orgd1e462b"></a>

## [Proof General](https://proofgeneral.github.io)

"Proof General is a generic interface for proof assistants (also known as interactive theorem provers), based on the extensible, customizable text editor Emacs." Since I'm an Emacs user, this has strong appeal.


<a id="orgf0b5bdb"></a>

## [SymPy Logic Module](https://docs.sympy.org/latest/modules/logic.html)

"The logic module for SymPy allows to form and manipulate logic expressions using symbolic and Boolean values."


<a id="orgd3ad69f"></a>

## [Taut](https://www.taut-logic.com)

"This is a website that contains randomly-generated, self-correcting logic excercises. It runs directly on your browser, so there is no need to download anything. It was designed by [Ariel Roffé](https://sites.google.com/view/ariel-roffe/home) (UBA / UNQ / CONICET), with support from the [BA-Logic](http://ba-logic.com) group"

---


<a id="org639a12a"></a>

# Programming Languages and Libraries


<a id="org136bf33"></a>

## [miniKanren](http://minikanren.org)

"miniKanren is an embedded Domain Specific Language for logic programming."

"miniKanren has been implemented in a growing number of host languages, including Scheme, Racket, Clojure, Haskell, Python, JavaScript, Scala, Ruby, OCaml, and PHP, among many other languages."


<a id="orgd202f3b"></a>

## Lisp


<a id="org51305dd"></a>

### [Common Lisp](https://common-lisp.net)

1.  [The Common Lisp Cookbook](https://lispcookbook.github.io/cl-cookbook/)

2.  [Practical Common Lisp](http://www.gigamonkeys.com/book/)

    "If you think the greatest pleasure in programming comes from getting a lot done with code that simply and clearly expresses your intention, then programming in Common Lisp is likely to be about the most fun you can have with a computer. You'll get more done, faster, using it than you would using pretty much any other language."


<a id="orgfdc272e"></a>

### [Clojure](https://clojure.org)


<a id="org9b22603"></a>

### [Scheme](https://schemers.org)


<a id="org9800eb3"></a>

## Prolog


<a id="orga4daf99"></a>

### [SWI-Prolog](https://www.swi-prolog.org)


<a id="org3d0bbda"></a>

### [A. Aaby's Prolog Tutorial](http://www.lix.polytechnique.fr/~liberti/public/computing/prog/prolog/prolog-tutorial.html)


<a id="org9f04b79"></a>

### [J.R. Fisher's Prolog Tutorial](https://www.cpp.edu/~jrfisher/www/prolog_tutorial/contents.html)


<a id="org61b47af"></a>

## Python


<a id="org2cde487"></a>

### [kanren](https://github.com/logpy/logpy)

"Logic Programming in Python"


<a id="org13cbaa1"></a>

### [PySWIP](https://github.com/yuce/pyswip)

"PySWIP is a Python - SWI-Prolog bridge enabling to query SWI-Prolog in your Python programs. It features an (incomplete) SWI-Prolog foreign language interface, a utility class that makes it easy querying with Prolog and also a Pythonic interface."


<a id="org553f9cb"></a>

### [truths - auto generate truth tables](https://github.com/tr3buchet/truths)


<a id="org4e6ecd5"></a>

### [tt - the Boolean expression toolbox](https://tt.brianwel.ch/en/latest/)

tt (truth table) is a library aiming to provide a Pythonic toolkit for working with Boolean expressions and truth tables.

---


<a id="orge086818"></a>

# Digital Philosophy


<a id="orgd24ca98"></a>

## [Articles tagged "digital humanities" at Daily Nous](http://dailynous.com/tag/digital-humanities/)


<a id="org8ecd910"></a>

## [Chris Alen Sula](http://chrisalensula.org)

"My work applies visualization and network science to humanities datasets, especially the history of philosophy. I also write on digital humanities and the politics of technology."


<a id="orgcd6c7ce"></a>

## [Philosopher's Web](https://kumu.io/GOliveira/philosophers-web#map-b9Ts7W5r)

A comprehensive map of all influential relationships in philosophy according to Wikipedia.


<a id="org86d725e"></a>

## [The Philosophome](http://ontology.buffalo.edu/philosophome.org.html)


<a id="orga6c69eb"></a>

## [Spinoza's Ethics 2.0](https://ethics.spinozism.org)

Created by [Torin Doppelt](https://www.torindoppelt.com)


<a id="org9e6c024"></a>

### [Digital Spinozism](https://www.torindoppelt.com/#posts)

Accompanying blog to Spinoza's Ethics 2.0


<a id="org9fa143b"></a>

## [Transcribing Bentham](https://blogs.ucl.ac.uk/transcribe-bentham/)


<a id="org7501839"></a>

## [Why and How: Exploring the Significance of Digital Humanities for Philosophy](https://digitalscholarship.files.wordpress.com/2013/02/spirowhydhapaphilosophy2013fnal.pdf)

This is a presentation by Lisa Spirohttps://digitalscholarship.wordpress.com)

---


<a id="orgb3faa50"></a>

# University Departments and Research Centers


<a id="org389f167"></a>

## [Philosophy of Computer Science - Utrecht University](http://www.cs.uu.nl/groups/AD/index-phil.html)

---


<a id="orgfd2e0a8"></a>

# Magazines and Newsletters


<a id="orga4b8449"></a>

## [ACM Transactions on Computational Logic (TOCL)](https://tocl.acm.org)

"For the purposes of ACM Transactions on Computational Logic, the field of computational logic consists of all uses of logic in computer science."


<a id="org0d0e2ff"></a>

## [Newsletter on Philosophy and Computers](https://www.apaonline.org/page/computers_newsletter) - American Philosophical Association

---


<a id="orgdad61fe"></a>

# Individual Philosophers


<a id="orge1c9056"></a>

## [Peter Bradley](http://www.kaley-bradley.com)


<a id="org30bf827"></a>

## [Luciano Floridi](http://www.philosophyofinformation.net/about/)


<a id="org35cd8f8"></a>

## [William J. Rapaport](https://cse.buffalo.edu/~rapaport/)

---


<a id="org52373ed"></a>

# Philosophical Networks


<a id="org4786d28"></a>

## [Philosophical Wordnets](https://github.com/mboudour/WordNets/tree/master/Philosophical%20WordNets)

Contributed by [Moses Boudorides](https://github.com/mboudour), a series of Jupyter notebooks showing sentence-co-occurring relationships among concepts. Works analyzed include Heidegger's "The Question Concerning Technology" and Nietzsche's "Thus Spake Zarathustra".

---


<a id="orgaf812c8"></a>

# Software for Philosophers


<a id="org0673900"></a>

## [Hypernomicon](http://hypernomicon.org)

"Personal philosophy database software," created by [Jason Winning](http://jasonwinning.com).
